DataProcessors/ПанельНастроекУправлениеПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПанельНастроекУправлениеПерсоналом</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОхраныТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеМестаОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьИнструктажиПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбучениеПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНесчастныеСлучаиНаПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьМедицинскиеОсмотры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПсихиатрическиеОсвидетельствования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСпециальнуюОценкуУсловийТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСредстваИндивидуальнойЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьУникальностьНомеровРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособКонтроляУникальностиНомеровРабочихМест</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыКонтроляУникальностиНомеровРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьУсловияТрудаРабочихМестОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПанельНастроекУправлениеПерсоналом/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СтруктураПараметровНастроек() Экспорт
	
	// ПараметрыНастроек - структура, 
	//		Ключ - имя настройки или действия
	//		Значение - тип Булево, если Истина, то эту настройку надо будет сохранить.
	
	ПараметрыНастроек = Новый Структура;
	ПараметрыНастроек.Вставить("ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций", Ложь);
	ПараметрыНастроек.Вставить("Организация", Ложь);
	ПараметрыНастроек.Вставить("НастройкиОхраныТруда", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьРабочиеМестаОхраныТруда", Ложь);
	ПараметрыНастроек.Вставить("ПрименятьУсловияТрудаРабочихМестОхраныТруда", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьСпециальнуюОценкуУсловийТруда", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьНесчастныеСлучаиНаПроизводстве", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьИнструктажиПоОхранеТруда", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьОбучениеПоОхранеТруда", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьМедицинскиеОсмотры", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьПсихиатрическиеОсвидетельствования", Ложь);
	ПараметрыНастроек.Вставить("ПорогАктуальностиВредныхФакторовВидовРабот", Ложь);
	ПараметрыНастроек.Вставить("ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьСредстваИндивидуальнойЗащиты", Ложь);
	ПараметрыНастроек.Вставить("КонтролироватьУникальностьНомеровРабочихМест", Ложь);
	ПараметрыНастроек.Вставить("СпособКонтроляУникальностиНомеровРабочихМест", Ложь);
	ПараметрыНастроек.Вставить("НастройкиГрейдов", Ложь);
	ПараметрыНастроек.Вставить("НастройкиКадровыхРешений", Ложь);
	ПараметрыНастроек.Вставить("НастройкиПодбораПерсонала", Ложь);
	ПараметрыНастроек.Вставить("НастройкиКлючевыхПоказателейЭффективности", Ложь);
	ПараметрыНастроек.Вставить("НастройкиЛьготСотрудников", Ложь);
	ПараметрыНастроек.Вставить("НастройкиОбученияРазвития", Ложь);
	ПараметрыНастроек.Вставить("НастройкиКадровогоРезерва", Ложь);
	ПараметрыНастроек.Вставить("НастройкиОценкиПерсонала", Ложь);
	ПараметрыНастроек.Вставить("НастройкиСамообслуживанияСотрудников", Ложь);
	ПараметрыНастроек.Вставить("ДополнительныеНастройкиУправленияПерсоналом", Ложь);
	ПараметрыНастроек.Вставить("НастройкиКонкурсов", Ложь);
	ПараметрыНастроек.Вставить("ИспользоватьФинансовыйУчет", Ложь);
	ПараметрыНастроек.Вставить("НастройкаМатрицыТалантов", Ложь);
	
	// СтруктураПараметров - элементы структуры значения настроек для сохранения
	СтруктураПараметров = Новый Структура("
	|ПараметрыНастроек,
	|ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций,
	|НастройкиОхраныТруда,
	|Организация,
	|ИспользоватьРабочиеМестаОхраныТруда,
	|ПрименятьУсловияТрудаРабочихМестОхраныТруда,
	|ИспользоватьСпециальнуюОценкуУсловийТруда,
	|ИспользоватьНесчастныеСлучаиНаПроизводстве,
	|ИспользоватьИнструктажиПоОхранеТруда,
	|ИспользоватьОбучениеПоОхранеТруда,
	|ИспользоватьМедицинскиеОсмотры,
	|ИспользоватьПсихиатрическиеОсвидетельствования,
	|ПорогАктуальностиВредныхФакторовВидовРабот,
	|ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот,
	|ИспользоватьСредстваИндивидуальнойЗащиты,
	|КонтролироватьУникальностьНомеровРабочихМест,
	|СпособКонтроляУникальностиНомеровРабочихМест,
	|НастройкиГрейдов,
	|НастройкиПодбораПерсонала,
	|НастройкиКадровыхРешений,
	|НастройкиКлючевыхПоказателейЭффективности,
	|НастройкиЛьготСотрудников,
	|НастройкиОбученияРазвития,
	|НастройкиКадровогоРезерва,
	|НастройкиОценкиПерсонала,
	|НастройкиСамообслуживанияСотрудников,
	|ДополнительныеНастройкиУправленияПерсоналом,
	|НастройкиКонкурсов,
	|ИспользоватьФинансовыйУчет,
	|НастройкаМатрицыТалантов");
	
	СтруктураПараметров.ПараметрыНастроек = ПараметрыНастроек;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ЗаполнитьСтруктуруПараметровНастроек(ИмяНастройки) Экспорт
	
	СтруктураПараметров = СтруктураПараметровНастроек();
	Настройки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяНастройки,,, Истина);
	Для Каждого Настройка Из Настройки Цикл
		СтруктураПараметров.ПараметрыНастроек[Настройка] = Истина;
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции 

Процедура ЗаписатьНастройки(Параметры, АдресХранилища) Экспорт
	
	// Параметры описаны в СтруктураПараметровНастроек.
	ПараметрыНастроек = Параметры.ПараметрыНастроек;
	
	НачатьТранзакцию();
	Попытка
		ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций = Константы.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций.Получить();
		Если ПараметрыНастроек.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций Тогда
			ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций = Параметры.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций;
			Константы.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций.Установить(
				Параметры.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций);
		КонецЕсли;
		
		Если ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций Тогда
			ЗаписатьНастройкиОхраныТрудаПоОрганизации(Параметры.Организация, Параметры, ПараметрыНастроек);
		Иначе
			Для Каждого Организация Из ОрганизационнаяСтруктура.ВсеОрганизацииБезУправленческой(, Ложь) Цикл
				ЗаписатьНастройкиОхраныТрудаПоОрганизации(Организация, Параметры, ПараметрыНастроек);
			КонецЦикла;
			ОхранаТруда.ЗаписатьОбщиеНастройкиОхраныТруда(Параметры, ПараметрыНастроек);
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкиПодбораПерсонала Тогда
			Настройки = РегистрыСведений.НастройкиПодбораПерсонала.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиПодбораПерсонала);
			Настройки.Записать();
		КонецЕсли;

		Если ПараметрыНастроек.НастройкиКадровыхРешений Тогда
			КадровыеРешенияРасширенный.УстановитьНастройкиКадровыхРешений(Параметры.НастройкиКадровыхРешений);
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкиЛьготСотрудников Тогда
			Настройки = РегистрыСведений.НастройкиЛьготСотрудников.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиЛьготСотрудников);
			Настройки.Записать();
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкиОбученияРазвития Тогда
			Настройки = РегистрыСведений.НастройкиОбученияРазвития.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиОбученияРазвития);
			Настройки.Записать();
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкиКадровогоРезерва Тогда
			Настройки = РегистрыСведений.НастройкиКадровогоРезерва.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиКадровогоРезерва);
			Настройки.Записать();
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкиОценкиПерсонала Тогда
			Настройки = РегистрыСведений.НастройкиОценкиПерсонала.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиОценкиПерсонала);
			Настройки.Записать();
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкиСамообслуживанияСотрудников Тогда
			Настройки = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиСамообслуживанияСотрудников);
			Настройки.Записать();
			
			СамообслуживаниеСотрудников.ЗаполнитьОграниченияПродолжительностиСеансаПоУмолчанию();
			СамообслуживаниеСотрудников.ЗаполнитьОграниченияНаКоличествоСеансовПоУмолчанию();
		КонецЕсли;
		
		Если ПараметрыНастроек.ДополнительныеНастройкиУправленияПерсоналом Тогда
			Настройки = РегистрыСведений.ДополнительныеНастройкиУправленияПерсоналом.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.ДополнительныеНастройкиУправленияПерсоналом);
			Настройки.Записать();
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Конкурсы") Тогда
			МодульКонкурсы = ОбщегоНазначения.ОбщийМодуль("Конкурсы");
			МодульКонкурсы.ПанельУправлениеПерсоналомЗаписатьНастройкиКонкурсов(Параметры, ПараметрыНастроек);
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("Грейды");
			Модуль.ПанельУправлениеПерсоналомЗаписатьНастройкиГрейдов(Параметры, ПараметрыНастроек);
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда 
			Модуль = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективности");
			Модуль.ПанельУправлениеПерсоналомЗаписатьНастройкиКлючевыхПоказателейЭффективности(Параметры, ПараметрыНастроек);
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда 
			МодульФинансовыйУчет = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчет");
			МодульФинансовыйУчет.ПанельУправлениеПерсоналомУстановитьИспользованиеФинансовогоУчета(Параметры, ПараметрыНастроек);
		КонецЕсли;
		
		Если ПараметрыНастроек.НастройкаМатрицыТалантов Тогда
			Настройки = РегистрыСведений.НастройкаМатрицыТалантов.СоздатьМенеджерЗаписи();
			РегистрыСведений.НастройкаМатрицыТалантов.ЗаполнитьРегистрПоУмолчанию(Параметры.НастройкаМатрицыТалантов);
			ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкаМатрицыТалантов);
			Настройки.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Запись настроек Управления персоналом'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Обработки.ПанельНастроекУправлениеПерсоналом,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	ПоместитьВоВременноеХранилище(Истина, АдресХранилища);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиОхраныТрудаПоОрганизации(Организация, Параметры, ПараметрыНастроек)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиОхраныТруда.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Настройки = НаборЗаписей.Добавить();
		Настройки.Организация = Организация;
	Иначе
		Настройки = НаборЗаписей[0];
	КонецЕсли;
	
	Записывать = Ложь;
	ПропускатьПроверкуСводныхНастроек = Истина;
	Если ПараметрыНастроек.ИспользоватьРабочиеМестаОхраныТруда Тогда
		Настройки.ИспользоватьРабочиеМестаОхраныТруда = Параметры.ИспользоватьРабочиеМестаОхраныТруда;
		Записывать = Истина;
		ПропускатьПроверкуСводныхНастроек = Ложь;
	КонецЕсли;
	
	Если ПараметрыНастроек.ПрименятьУсловияТрудаРабочихМестОхраныТруда Тогда
		Настройки.ПрименятьУсловияТрудаРабочихМестОхраныТруда = Параметры.ПрименятьУсловияТрудаРабочихМестОхраныТруда;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		Настройки.ИспользоватьСпециальнуюОценкуУсловийТруда = Параметры.ИспользоватьСпециальнуюОценкуУсловийТруда;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьНесчастныеСлучаиНаПроизводстве Тогда
		Настройки.ИспользоватьНесчастныеСлучаиНаПроизводстве = Параметры.ИспользоватьНесчастныеСлучаиНаПроизводстве;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьИнструктажиПоОхранеТруда Тогда
		Настройки.ИспользоватьИнструктажиПоОхранеТруда = Параметры.ИспользоватьИнструктажиПоОхранеТруда;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьОбучениеПоОхранеТруда Тогда
		Настройки.ИспользоватьОбучениеПоОхранеТруда = Параметры.ИспользоватьОбучениеПоОхранеТруда;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьМедицинскиеОсмотры Тогда
		Настройки.ИспользоватьМедицинскиеОсмотры = Параметры.ИспользоватьМедицинскиеОсмотры;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		Настройки.ИспользоватьПсихиатрическиеОсвидетельствования = Параметры.ИспользоватьПсихиатрическиеОсвидетельствования;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ПорогАктуальностиВредныхФакторовВидовРабот Тогда
		Настройки.ПорогАктуальностиВредныхФакторовВидовРабот = Параметры.ПорогАктуальностиВредныхФакторовВидовРабот;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот Тогда
		Настройки.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот = Параметры.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.ИспользоватьСредстваИндивидуальнойЗащиты Тогда
		Настройки.ИспользоватьСредстваИндивидуальнойЗащиты = Параметры.ИспользоватьСредстваИндивидуальнойЗащиты;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.КонтролироватьУникальностьНомеровРабочихМест Тогда
		Настройки.КонтролироватьУникальностьНомеровРабочихМест = Параметры.КонтролироватьУникальностьНомеровРабочихМест;
		Записывать = Истина;
	КонецЕсли;
	
	Если ПараметрыНастроек.СпособКонтроляУникальностиНомеровРабочихМест Тогда
		Настройки.СпособКонтроляУникальностиНомеровРабочихМест = Параметры.СпособКонтроляУникальностиНомеровРабочихМест;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропускатьПроверкуСводныхНастроек", ПропускатьПроверкуСводныхНастроек);
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
